spec/fixtures/soap/xml/IControl/LocalLB/ProfileHttpClass/IControl.LocalLB.ProfileHttpClass_before_add.add_cookie_match_pattern_3433940f360a3ca1bbdfea7bfc074660_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="urn:iControl:LocalLB/ProfileHttpClass"><env:Body><wsdl:add_cookie_match_pattern><profile_names><value>test_profile1</value></profile_names><patterns><item><value><pattern>test_cookie</pattern><is_glob>false</is_glob></value></item></patterns></wsdl:add_cookie_match_pattern></env:Body></env:Envelope>